Hi folks 👋 Sorry for the strange behavior here.

In version 2.0.0 and later of the Terraform AWS Provider, the `aws_route53_record` resource now properly submits the record changeset with the action set to `CREATE` instead of `UPSERT` (unless the `allow_overwrite = true` configuration is used, which is only necessary for `NS`/`SOA` records or other rare scenarios). Using the below configuration:

```hcl
# Example in Terraform 0.12 syntax
terraform {
  required_providers {
    aws = "2.18.0"
  }
  required_version = "0.12.3"
}

provider "aws" {
  region = "us-east-1"
}

resource "aws_route53_zone" "main" {
  name = "notexample.com."
}

resource "aws_route53_record" "www" {
  zone_id = aws_route53_zone.main.zone_id

  name    = "www.${aws_route53_zone.main.name}"
  type    = "CNAME"
  ttl     = "300"
  records = [aws_route53_zone.main.name]
}

resource "aws_route53_record" "wwwooops" {
  zone_id = aws_route53_zone.main.zone_id
  name    = "www.${aws_route53_zone.main.name}"
  type    = "CNAME"
  ttl     = "300"
  records = ["somethingdifferent.com"]
}
```

Terraform seems to perform the correct behavior with duplicate Route 53 Records.

```console
$ terraform init
...
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.www will be created
  + resource "aws_route53_record" "www" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.notexample.com"
      + records         = [
          + "notexample.com.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_record.wwwooops will be created
  + resource "aws_route53_record" "wwwooops" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.notexample.com"
      + records         = [
          + "somethingdifferent.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.main will be created
  + resource "aws_route53_zone" "main" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "notexample.com."
      + name_servers  = (known after apply)
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      + zone_id       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_zone.main: Creating...
aws_route53_zone.main: Still creating... [10s elapsed]
aws_route53_zone.main: Still creating... [20s elapsed]
aws_route53_zone.main: Still creating... [30s elapsed]
aws_route53_zone.main: Creation complete after 39s [id=Z2OUVQU7PCG13Q]
aws_route53_record.www: Creating...
aws_route53_record.wwwooops: Creating...
aws_route53_record.www: Still creating... [10s elapsed]
aws_route53_record.www: Still creating... [20s elapsed]
aws_route53_record.www: Still creating... [30s elapsed]
aws_route53_record.www: Creation complete after 36s [id=Z2OUVQU7PCG13Q_www.notexample.com._CNAME]

Error: [ERR]: Error building changeset: InvalidChangeBatch: [Tried to create resource record set [name='www.notexample.com.', type='CNAME'] but it already exists]
	status code: 400, request id: 49a9b759-cfce-4a35-9713-4b9855760d32

  on main.tf line 25, in resource "aws_route53_record" "wwwooops":
  25: resource "aws_route53_record" "wwwooops" {

$ terraform apply
aws_route53_zone.main: Refreshing state... [id=Z2OUVQU7PCG13Q]
aws_route53_record.www: Refreshing state... [id=Z2OUVQU7PCG13Q_www.notexample.com._CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.wwwooops will be created
  + resource "aws_route53_record" "wwwooops" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.notexample.com"
      + records         = [
          + "somethingdifferent.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z2OUVQU7PCG13Q"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_route53_record.wwwooops: Creating...

Error: [ERR]: Error building changeset: InvalidChangeBatch: [Tried to create resource record set [name='www.notexample.com.', type='CNAME'] but it already exists]
	status code: 400, request id: 8999ba1f-8e81-4ad5-9c26-9ad5b8af777a

  on main.tf line 25, in resource "aws_route53_record" "wwwooops":
  25: resource "aws_route53_record" "wwwooops" {
```

For further feature requests or bug reports with this functionality, please create a [new GitHub issue](https://github.com/terraform-providers/terraform-provider-aws/issues/new/choose) following the template for triage. Thanks!